"Install" = "התקן";
"Update" = "עדכן";
"Install Results" = "תוצאות ההתקנה";
"OK" = "אישור";
"SlimServer installed successfully.\n" = "התקנת SlimServer הושלמה בהצלחה.";
"SlimServer install failed.\n" = "כשל בהתקנת SlimServer.";
"You must have OS X 10.3 or later to run SlimServer.\n" = "יש צורך ב-OS X 10.3 ואילך להפעלת SlimServer.";
"Mac OS X 10.3 Required" = "יש צורך ב-Mac OS X 10.3";